# Python Basics

## Pandas Basics

In [1]:
import numpy as np
import pandas as pd

### Object creation

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
d = pd.Series([1, 3, 5, np.nan, 'string', 8]) # this is also possible
print(s)
print(d)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64
0         1
1         3
2         5
3       NaN
4    string
5         8
dtype: object

In [3]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
np.random.randn(6, 4) #this is a dataframe.

array([[-1.49849753,  0.06643387, -0.28717188,  0.38125537],
       [ 0.55000859, -2.12640071, -0.66266833,  0.75770845],
       [ 0.9127764 , -1.12329633,  0.25910229, -0.75493689],
       [-2.68310817, -1.33978007,  0.82600857,  0.95640103],
       [ 1.96176089,  0.9119835 ,  0.66159747, -0.85596322],
       [ 0.10966504,  1.09425267,  0.23366793, -0.48779716]])

In [5]:
df = pd.DataFrame(np.random.randn(6, 4))
df #this is when you don't set the names. The default comes out.

          0         1         2         3
0 -1.045826  1.475079  0.898200  0.540773
1  2.176729  1.005278  1.071215  0.181139
2  0.111005 -0.243766  0.651458 -0.257080
3 -0.444785 -0.685816  1.221655  0.780879
4 -0.395799  0.065409  0.368840  1.607369
5 -1.069272  0.908332  0.499764  0.870178

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD")) #you can set by df.colums too.
df

                   A         B         C         D
2013-01-01  0.076489 -0.968479  1.975303 -0.252101
2013-01-02  0.856344  1.305198 -0.125614 -1.291700
2013-01-03 -0.255068  1.666500  2.175547 -0.768966
2013-01-04 -0.202280 -1.961442 -0.621269 -0.244013
2013-01-05  0.277272 -1.200997  1.893881  1.767920
2013-01-06  1.442937  0.062631 -0.479057 -2.397993

In [7]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

### Viewing data

In [9]:
df.head()

                   A         B         C         D
2013-01-01  0.076489 -0.968479  1.975303 -0.252101
2013-01-02  0.856344  1.305198 -0.125614 -1.291700
2013-01-03 -0.255068  1.666500  2.175547 -0.768966
2013-01-04 -0.202280 -1.961442 -0.621269 -0.244013
2013-01-05  0.277272 -1.200997  1.893881  1.767920

In [10]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.202280 -1.961442 -0.621269 -0.244013
2013-01-05  0.277272 -1.200997  1.893881  1.767920
2013-01-06  1.442937  0.062631 -0.479057 -2.397993

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.365949 -0.182765  0.803132 -0.531142
std    0.663413  1.449957  1.340353  1.383194
min   -0.255068 -1.961442 -0.621269 -2.397993
25%   -0.132588 -1.142867 -0.390696 -1.161017
50%    0.176880 -0.452924  0.884134 -0.510534
75%    0.711576  0.994556  1.954948 -0.246035
max    1.442937  1.666500  2.175547  1.767920

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.076489    0.856344   -0.255068   -0.202280    0.277272    1.442937
B   -0.968479    1.305198    1.666500   -1.961442   -1.200997    0.062631
C    1.975303   -0.125614    2.175547   -0.621269    1.893881   -0.479057
D   -0.252101   -1.291700   -0.768966   -0.244013    1.767920   -2.397993

In [15]:
df.sort_values(by="B", ascending=False) #If TRUE then descending.

                   A         B         C         D
2013-01-03 -0.255068  1.666500  2.175547 -0.768966
2013-01-02  0.856344  1.305198 -0.125614 -1.291700
2013-01-06  1.442937  0.062631 -0.479057 -2.397993
2013-01-01  0.076489 -0.968479  1.975303 -0.252101
2013-01-05  0.277272 -1.200997  1.893881  1.767920
2013-01-04 -0.202280 -1.961442 -0.621269 -0.244013

### Selection

In [16]:
df["A"]

2013-01-01    0.076489
2013-01-02    0.856344
2013-01-03   -0.255068
2013-01-04   -0.202280
2013-01-05    0.277272
2013-01-06    1.442937
Freq: D, Name: A, dtype: float64

In [17]:
df[0:3]

                   A         B         C         D
2013-01-01  0.076489 -0.968479  1.975303 -0.252101
2013-01-02  0.856344  1.305198 -0.125614 -1.291700
2013-01-03 -0.255068  1.666500  2.175547 -0.768966

In [18]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.856344  1.305198 -0.125614 -1.291700
2013-01-03 -0.255068  1.666500  2.175547 -0.768966
2013-01-04 -0.202280 -1.961442 -0.621269 -0.244013

In [19]:
df.loc[dates[0]]

A    0.076489
B   -0.968479
C    1.975303
D   -0.252101
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
df.loc[:, ["A", "B"]] # ':'->means selecting all rows.

                   A         B
2013-01-01  0.076489 -0.968479
2013-01-02  0.856344  1.305198
2013-01-03 -0.255068  1.666500
2013-01-04 -0.202280 -1.961442
2013-01-05  0.277272 -1.200997
2013-01-06  1.442937  0.062631

In [21]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.856344  1.305198
2013-01-03 -0.255068  1.666500
2013-01-04 -0.202280 -1.961442

In [22]:
df.loc[dates[0], "A"]

0.07648922852985696

In [23]:
df.iloc[3] #values of 4th row

A   -0.202280
B   -1.961442
C   -0.621269
D   -0.244013
Name: 2013-01-04 00:00:00, dtype: float64

In [24]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.202280 -1.961442
2013-01-05  0.277272 -1.200997

In [25]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.856344 -0.125614
2013-01-03 -0.255068  2.175547
2013-01-05  0.277272  1.893881

In [26]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.856344  1.305198 -0.125614 -1.291700
2013-01-03 -0.255068  1.666500  2.175547 -0.768966

In [27]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.968479  1.975303
2013-01-02  1.305198 -0.125614
2013-01-03  1.666500  2.175547
2013-01-04 -1.961442 -0.621269
2013-01-05 -1.200997  1.893881
2013-01-06  0.062631 -0.479057

In [28]:
df.iloc[1, 1]

1.3051975816362174

In [29]:
df[df["A"] > 0] #This means "select the rows that has only posirive values in column A"

                   A         B         C         D
2013-01-01  0.076489 -0.968479  1.975303 -0.252101
2013-01-02  0.856344  1.305198 -0.125614 -1.291700
2013-01-05  0.277272 -1.200997  1.893881  1.767920
2013-01-06  1.442937  0.062631 -0.479057 -2.397993

In [30]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.076489 -0.968479  1.975303 -0.252101    one
2013-01-02  0.856344  1.305198 -0.125614 -1.291700    one
2013-01-03 -0.255068  1.666500  2.175547 -0.768966    two
2013-01-04 -0.202280 -1.961442 -0.621269 -0.244013  three
2013-01-05  0.277272 -1.200997  1.893881  1.767920   four
2013-01-06  1.442937  0.062631 -0.479057 -2.397993  three

In [31]:
df2['F']= 1 #creat a column with all same value
df2

                   A         B         C         D      E  F
2013-01-01  0.076489 -0.968479  1.975303 -0.252101    one  1
2013-01-02  0.856344  1.305198 -0.125614 -1.291700    one  1
2013-01-03 -0.255068  1.666500  2.175547 -0.768966    two  1
2013-01-04 -0.202280 -1.961442 -0.621269 -0.244013  three  1
2013-01-05  0.277272 -1.200997  1.893881  1.767920   four  1
2013-01-06  1.442937  0.062631 -0.479057 -2.397993  three  1

In [32]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E  F
2013-01-03 -0.255068  1.666500  2.175547 -0.768966   two  1
2013-01-05  0.277272 -1.200997  1.893881  1.767920  four  1

In [33]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [34]:
df["F"] = s1

In [35]:
df.loc[dates[0], "A"] = 0

In [36]:
df.iloc[0, 1] = 0

In [37]:
df.loc[:, "D"] = np.array([5] * len(df))

In [38]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.975303  5  NaN
2013-01-02  0.856344  1.305198 -0.125614  5  1.0
2013-01-03 -0.255068  1.666500  2.175547  5  2.0
2013-01-04 -0.202280 -1.961442 -0.621269  5  3.0
2013-01-05  0.277272 -1.200997  1.893881  5  4.0
2013-01-06  1.442937  0.062631 -0.479057  5  5.0

### Missing data

In [39]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.975303  5  NaN  1.0
2013-01-02  0.856344  1.305198 -0.125614  5  1.0  1.0
2013-01-03 -0.255068  1.666500  2.175547  5  2.0  NaN
2013-01-04 -0.202280 -1.961442 -0.621269  5  3.0  NaN

In [40]:
df1.dropna() #This removes the rows that have a missing value.

                   A         B         C  D    F    E
2013-01-02  0.856344  1.305198 -0.125614  5  1.0  1.0

In [41]:
df1.fillna(value=5) #his exchanges the rows that have a missing value into other thing.

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.975303  5  5.0  1.0
2013-01-02  0.856344  1.305198 -0.125614  5  1.0  1.0
2013-01-03 -0.255068  1.666500  2.175547  5  2.0  5.0
2013-01-04 -0.202280 -1.961442 -0.621269  5  3.0  5.0

In [42]:
pd.isna(df1) #True means it is NA

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

### Operations

In [43]:
df.mean()

A    0.353201
B   -0.021352
C    0.803132
D    5.000000
F    3.000000
dtype: float64

In [44]:
df.mean(axis=1)

2013-01-01    1.743826
2013-01-02    1.607186
2013-01-03    2.117396
2013-01-04    1.043002
2013-01-05    1.994031
2013-01-06    2.205302
Freq: D, dtype: float64

### Merge

In [45]:
df1 = pd.DataFrame(np.random.randn(2, 3))
df1

          0         1         2
0  1.564249  1.117224  1.161982
1 -0.477167  1.883551 -1.171503

In [46]:
df2 = pd.DataFrame(np.random.randn(2, 3))
df2

          0         1         2
0 -0.659938 -2.598434 -0.760430
1  2.214076 -1.860326  0.234312

In [47]:
pd.concat([df1, df2])

          0         1         2
0  1.564249  1.117224  1.161982
1 -0.477167  1.883551 -1.171503
0 -0.659938 -2.598434 -0.760430
1  2.214076 -1.860326  0.234312

In [48]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [49]:
left

   key  lval
0  foo     1
1  foo     2

In [50]:
right

   key  rval
0  foo     4
1  foo     5

In [51]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [52]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

In [53]:
left

   key  lval
0  foo     1
1  bar     2

In [54]:
right

   key  rval
0  foo     4
1  bar     5

In [55]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Grouping

In [56]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one  1.076954 -0.070953
1  bar    one -0.007154  0.297791
2  foo    two -0.147068  0.458629
3  bar  three -0.258064  0.312040
4  foo    two  0.566122  1.075603
5  bar    two  0.503049 -0.507121
6  foo    one  0.631167  1.891528
7  foo  three  0.252422  0.564043

In [57]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  0.237831  0.102711
foo  2.379597  3.918850

In [58]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -0.007154  0.297791
    three -0.258064  0.312040
    two    0.503049 -0.507121
foo one    1.708121  1.820575
    three  0.252422  0.564043
    two    0.419054  1.534232

### Importing and exporting data

In [59]:
df = pd.DataFrame(np.random.randint(0, 5, (10, 5)))
df.to_csv("foo.csv")

In [60]:
pd.read_csv("foo.csv")

   Unnamed: 0  0  1  2  3  4
0           0  2  2  2  0  2
1           1  2  3  2  1  3
2           2  4  2  1  1  2
3           3  1  3  0  0  2
4           4  4  4  1  0  1
5           5  4  4  0  4  4
6           6  4  2  4  1  1
7           7  2  1  0  1  3
8           8  2  2  4  3  0
9           9  3  2  2  3  1